CD2DPointF.op_Implicit~CPoint
Converts CD2DPointF to CPoint object.
Returns:
Current value of D2D point.

CD2DPointF.#ctor(System.Single,System.Single)
Constructs a CD2DPointF object from two FLOAT values.
fX: source X
fY: source Y

CD2DPointF.#ctor(D2D_POINT_2F!System.Runtime.CompilerServices.IsConst*)
Constructs a CD2DPointF object from D2D1_POINT_2F object.
pt: source point

CD2DPointF.#ctor(D2D_POINT_2F!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DPointF object from D2D1_POINT_2F object.
pt: source point

CD2DPointF.#ctor(CPoint!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DPointF object from CPoint object.
pt: source point

CD2DPointF
D2D1_POINT_2F wrapper